res/depthCharge2d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices        // 8 vertices
(
    (0 0 -0.1)
    (1 0 -0.1)
    (1 2 -0.1)
    (0 2 -0.1)
    (0 0 0.1)
    (1 0 0.1)
    (1 2 0.1)
    (0 2 0.1)
);

blocks          // 1 bloque, 
                // (80 160 1) es la cantidad de celdas por dimension.
                // en z hay una sola por ser un caso 2d.
(
    hex (0 1 2 3 4 5 6 7) (80 160 1) simpleGrading (1 1 1)
);

patches         // limites de las paredes
(
    wall walls
    (
        (3 7 6 2)
        (0 4 7 3)
        (2 6 5 1)
        (1 5 4 0)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

// ************************************************************************* //
